TestEDT/src/Documents/уа_ВводВыводЦенныхБумаг/уа_ВводВыводЦенныхБумаг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уа_ВводВыводЦенныхБумаг</name>
  <registerRecords>AccountingRegister.ЕПС</registerRecords>
  <registerRecords>AccumulationRegister.уа_РасчетыПоЦеннымБумагам</registerRecords>
  <registerRecords>InformationRegister.уа_ПараметрыРасчетаАмортизации</registerRecords>
  <attributes>
    <name>Портфель</name>
    <type>
      <types>CatalogRef.Портфели</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценочнаяКатегория</name>
    <type>
      <types>EnumRef.уа_ОценочнаяКатегория</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.уа_ВидыОперацийВводВыводАктивовИзДУ</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Активы</name>
    <attributes>
      <name>ДатаПартии</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПартии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦеннаяБумага</name>
      <type>
        <types>CatalogRef.уа_ФинансовыеИнструменты</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>КратностьДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПриобретения</name>
      <type>
        <types>DefinedType.уа_Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаАмортизации</name>
      <type>
        <types>DefinedType.уа_Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаНакопленногоДисконта</name>
      <type>
        <types>DefinedType.уа_Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияАмортизации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАмортизации</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАмортизацииВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>ПогашеннаяАмортизацияДисконта</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>НКД</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>НКДВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>УКД</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>УКДВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИндексацииНоминала</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИндексацииНоминалаВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПереоценки</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПереоценкиВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКорректировки</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКорректировкиВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКупонаКПолучению</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКупонаКПолучениюВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРезерва</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРезерваВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНоминалаКПолучению</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНоминалаКПолучениюВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭСП</name>
      <type>
        <types>DefinedType.уа_Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНУ</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаЕПС</name>
      <type>
        <types>ChartOfAccountsRef.ЕПС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TestEDT/src/AccumulationRegisters/уа_РасчетыПоЦеннымБумагам/уа_РасчетыПоЦеннымБумагам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уа_РасчетыПоЦеннымБумагам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаАмортизации</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>ПогашеннаяАмортизацияДисконта</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаПоложительнойПереоценки</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаОтрицательнойПереоценки</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаПоложительнойИндексацииНоминала</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаОтрицательнойИндексацииНоминала</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаПоложительнойКорректировки</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаОтрицательнойКорректировки</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРезерва</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>НКД</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>УКД</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаКупонаКПолучению</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНоминалаКПолучению</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <dimensions>
    <name>Портфель</name>
    <type>
      <types>CatalogRef.Портфели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦеннаяБумага</name>
    <type>
      <types>CatalogRef.уа_ФинансовыеИнструменты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОценочнаяКатегория</name>
    <type>
      <types>EnumRef.уа_ОценочнаяКатегория</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

TestEDT/src/AccountingRegisters/ЕПС/ЕПС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>ЕПС</name>
  <chartOfAccounts>ChartOfAccounts.ЕПС</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Портфель</name>
    <type>
      <types>CatalogRef.Портфели</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.ЕПС.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.уа_ЛицевыеСчетаЕПС</types>
    </type>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.ЕПС.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.ЕПС.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.ЕПС.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.УА_КоличествоЦенныхБумаг</types>
    </type>
    <accountingFlag>ChartOfAccounts.ЕПС.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.ЕПС.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.ЕПС.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.ЕПС.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

TestEDT/src/InformationRegisters/уа_ПараметрыРасчетаАмортизации/уа_ПараметрыРасчетаАмортизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уа_ПараметрыРасчетаАмортизации</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаАмортизации</name>
    <type>
      <types>DefinedType.уа_Цена</types>
    </type>
  </resources>
  <resources>
    <name>ЦенаНакопленногоДисконта</name>
    <type>
      <types>DefinedType.уа_Цена</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияАмортизации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭСП</name>
    <type>
      <types>DefinedType.уа_Цена</types>
    </type>
  </resources>
  <dimensions>
    <name>Портфель</name>
    <type>
      <types>CatalogRef.Портфели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦеннаяБумага</name>
    <type>
      <types>CatalogRef.уа_ФинансовыеИнструменты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestEDT/src/Enums/уа_ВидыОперацийВводВыводАктивовИзДУ/уа_ВидыОперацийВводВыводАктивовИзДУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уа_ВидыОперацийВводВыводАктивовИзДУ</name>
  <enumValues>
    <name>ВводАктивовВДУ</name>
  </enumValues>
  <enumValues>
    <name>ВыводАктивовИзДУ</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/Enums/уа_ВидыСтоимости/уа_ВидыСтоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уа_ВидыСтоимости</name>
  <enumValues>
    <name>Стоимость</name>
  </enumValues>
  <enumValues>
    <name>УНКД</name>
  </enumValues>
  <enumValues>
    <name>Премия</name>
  </enumValues>
  <enumValues>
    <name>Дисконт</name>
  </enumValues>
  <enumValues>
    <name>НКД</name>
  </enumValues>
  <enumValues>
    <name>Индексация</name>
  </enumValues>
  <enumValues>
    <name>КупонКВыплате</name>
  </enumValues>
  <enumValues>
    <name>НоминалКВыплате</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/Enums/уа_ОценочнаяКатегория/уа_ОценочнаяКатегория.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уа_ОценочнаяКатегория</name>
  <enumValues>
    <name>АктивыПоСправедливойСтоимостиПрибыль</name>
  </enumValues>
  <enumValues>
    <name>АктивыДляПерепродажи</name>
  </enumValues>
  <enumValues>
    <name>ИнвестицииДоПогашения</name>
  </enumValues>
  <enumValues>
    <name>АктивыПоАмортизированнойСтоимости</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/Documents/уа_ВводВыводЦенныхБумаг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ
Процедура УстановитьПартииДляАктивов()
	
	Если ЭтоНовый() Тогда
		УстановитьСсылкуНового(Документы.уа_ВводВыводЦенныхБумаг.ПолучитьСсылку(Новый УникальныйИдентификатор));
	КонецЕсли;
	
	СсылкаНаДокумент = ?(ЭтоНовый(), ПолучитьСсылкуНового(), Ссылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ссылка
		|ИЗ
		|	Документ.уа_Партия 
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И ДокументОснование = &ДокументОснование
		|	И Портфель = &Портфель
		|	И НомерВходящегоДокумента = &НомерВходящегоДокумента
		|	И ДатаВходящегоДокумента = &ДатаВходящегоДокумента
		|	И ЦеннаяБумага = &ЦеннаяБумага";
		
	Запрос.УстановитьПараметр("Портфель", Портфель);
	Запрос.УстановитьПараметр("ДокументОснование", СсылкаНаДокумент);
	
	Автор = ПараметрыСеанса.ТекущийПользователь;
		
	Для Каждого СтрокаАктива Из Активы Цикл		
		Если Не ЗначениеЗаполнено(СтрокаАктива.Партия) И (ЗначениеЗаполнено(СтрокаАктива.ДатаПартии) Или ЗначениеЗаполнено(СтрокаАктива.НомерПартии)) Тогда
			Запрос.УстановитьПараметр("ДатаВходящегоДокумента", СтрокаАктива.ДатаПартии);
			Запрос.УстановитьПараметр("НомерВходящегоДокумента", СтрокаАктива.НомерПартии);
			Запрос.УстановитьПараметр("ЦеннаяБумага", СтрокаАктива.ЦеннаяБумага);
			
			ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();   			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда  				
				СтрокаАктива.Партия = ВыборкаДетальныеЗаписи.Ссылка;				
			КонецЕсли;                     			
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(СтрокаАктива.Партия) Тогда
			ДатаПартии = СтрокаАктива.ДатаПартии + Активы.Индекс(СтрокаАктива);
						
			Документ						= Документы.уа_Партия.СоздатьДокумент();
			Документ.Дата 					= ДатаПартии;
			Документ.ДокументОснование 		= СсылкаНаДокумент;
			Документ.Портфель 				= Портфель;
			Документ.Комментарий 			= "Поступление ц/б  """ + СтрокаАктива.ЦеннаяБумага.Наименование+"""" ;
			Документ.ДатаВходящегоДокумента = СтрокаАктива.ДатаПартии;
			Документ.НомерВходящегоДокумента= СтрокаАктива.НомерПартии;
			Документ.ЦеннаяБумага			= СтрокаАктива.ЦеннаяБумага;
			Документ.ЦенаПриобретения		= СтрокаАктива.ЦенаПриобретения;	
			Документ.Автор					= Автор;
			Документ.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
			Документ.Записать();
			
			СтрокаАктива.Партия = Документ.Ссылка;
		КонецЕсли;   		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДозаполнитьДанныеАктивов() 
	
	Для Каждого СтрокаАктивов Из Активы Цикл     		
		Если Не ЗначениеЗаполнено(СтрокаАктивов.СчетУчетаЕПС) Тогда
			Если Не ЗначениеЗаполнено(СтрокаАктивов.ЦеннаяБумага) Или НЕ ЗначениеЗаполнено(ОценочнаяКатегория) Тогда 
				Продолжить;	
			КонецЕсли;			
			СчетаАктива = уа_БухгалтерскийУчетПовтИсп.СчетаАктива(НачалоДня(Дата), СтрокаАктивов.ЦеннаяБумага, ОценочнаяКатегория);
			СтрокаАктивов.СчетУчетаЕПС = СчетаАктива.СчетУчета;			
		КонецЕсли; 
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда Возврат; КонецЕсли;
	
	Если ВидОперации = Перечисления.уа_ВидыОперацийВводВыводАктивовИзДУ.ВводАктивовВДУ И Не ПометкаУдаления Тогда
		УстановитьПартииДляАктивов();
		ДозаполнитьДанныеАктивов();
	КонецЕсли; 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	СформироватьЗаписиВРегистрах(Отказ);
	СформироватьДвиженияВОперативномУчете(Отказ);
	СформироватьДвиженияВБухгалтерскомУчете(Отказ);
КонецПроцедуры
#КонецОбласти 

Функция ПодготовитьТаблицуДанныхВводаЦБ(Ссылка, СальдироватьПоПартиям)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	ЦеннаяБумага, 
	|	Валюта, 
	|	ВЫБОР КОГДА &СальдироватьПоПартиям ТОГДА NULL ИНАЧЕ Партия КОНЕЦ КАК Партия,
	|	СУММА(Количество) КАК Количество,
	|	СУММА(СуммаВал) КАК СуммаВал,
	|	СУММА(Сумма) КАК Сумма, 
	|	СУММА(ВЫБОР КОГДА СуммаАмортизацииВал >= 0 ТОГДА СуммаАмортизацииВал ИНАЧЕ 0 КОНЕЦ ) КАК СуммаПремииВал,
	|	СУММА(ВЫБОР КОГДА СуммаАмортизации >= 0 ТОГДА СуммаАмортизации ИНАЧЕ 0 КОНЕЦ) КАК СуммаПремии,
	|	СУММА(ВЫБОР КОГДА СуммаАмортизацииВал < 0 ТОГДА -СуммаАмортизацииВал ИНАЧЕ 0 КОНЕЦ ) КАК СуммаДисконтаВал,
	|	СУММА(ВЫБОР КОГДА СуммаАмортизации < 0 ТОГДА -СуммаАмортизации ИНАЧЕ 0 КОНЕЦ) КАК СуммаДисконта,
	|   СУММА(НКДВал) КАК НКДВал, 
	|	СУММА(НКД) КАК НКД,
	|	СУММА(УКДВал) КАК УКДВал, 
	|	СУММА(УКД) КАК УКД,
	|	СУММА(ВЫБОР КОГДА СуммаПереоценкиВал >= 0 ТОГДА СуммаПереоценкиВал ИНАЧЕ 0 КОНЕЦ) КАК СуммаПоложительнойПереоценкиВал,
	|	СУММА(ВЫБОР КОГДА СуммаПереоценки >= 0 ТОГДА СуммаПереоценки ИНАЧЕ 0 КОНЕЦ) КАК СуммаПоложительнойПереоценки,
	|	СУММА(ВЫБОР КОГДА СуммаПереоценкиВал < 0 ТОГДА -СуммаПереоценкиВал ИНАЧЕ 0 КОНЕЦ) КАК СуммаОтрицательнойПереоценкиВал,
	|	СУММА(ВЫБОР КОГДА СуммаПереоценки < 0 ТОГДА -СуммаПереоценки ИНАЧЕ 0 КОНЕЦ) КАК СуммаОтрицательнойПереоценки,
	|	СУММА(ВЫБОР КОГДА СуммаИндексацииНоминалаВал >= 0 ТОГДА СуммаИндексацииНоминалаВал ИНАЧЕ 0 КОНЕЦ) КАК СуммаПоложительнойИндексацииНоминалаВал,
	|	СУММА(ВЫБОР КОГДА СуммаИндексацииНоминала >= 0 ТОГДА СуммаИндексацииНоминала ИНАЧЕ 0 КОНЕЦ) КАК СуммаПоложительнойИндексацииНоминала,
	|	СУММА(ВЫБОР КОГДА СуммаИндексацииНоминалаВал < 0 ТОГДА -СуммаИндексацииНоминалаВал ИНАЧЕ 0 КОНЕЦ) КАК СуммаОтрицательнойИндексацииНоминалаВал,
	|	СУММА(ВЫБОР КОГДА СуммаИндексацииНоминала < 0 ТОГДА -СуммаИндексацииНоминала ИНАЧЕ 0 КОНЕЦ) КАК СуммаОтрицательнойИндексацииНоминала,
	|	СУММА(ВЫБОР КОГДА СуммаКорректировкиВал >= 0 ТОГДА СуммаКорректировкиВал ИНАЧЕ 0 КОНЕЦ) КАК СуммаПоложительнойКорректировкиВал,
	|	СУММА(ВЫБОР КОГДА СуммаКорректировки >= 0 ТОГДА СуммаКорректировки ИНАЧЕ 0 КОНЕЦ) КАК СуммаПоложительнойКорректировки,
	|	СУММА(ВЫБОР КОГДА СуммаКорректировкиВал < 0 ТОГДА -СуммаКорректировкиВал ИНАЧЕ 0 КОНЕЦ) КАК СуммаОтрицательнойКорректировкиВал,
	|	СУММА(ВЫБОР КОГДА СуммаКорректировки < 0 ТОГДА -СуммаКорректировки ИНАЧЕ 0 КОНЕЦ) КАК СуммаОтрицательнойКорректировки,
	|	СУММА(СуммаКупонаКПолучениюВал) КАК СуммаКупонаКПолучениюВал, 
	|	СУММА(СуммаКупонаКПолучению) КАК СуммаКупонаКПолучению,
	|   СУММА(СуммаНоминалаКПолучениюВал) КАК СуммаНоминалаКПолучениюВал, 
	|	СУММА(СуммаНоминалаКПолучению) КАК СуммаНоминалаКПолучению,
	|	СУММА(СуммаРезерваВал) КАК СуммаРезерваВал, 
	|	СУММА(СуммаРезерва) КАК СуммаРезерва,
	|	СУММА(СуммаНУ) КАК СуммаНУ
	|ИЗ Документ.уа_ВводВыводЦенныхБумаг.Активы
	|ГДЕ Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО 
	|	ЦеннаяБумага, 
	|	Валюта, 
	|	ВЫБОР КОГДА &СальдироватьПоПартиям ТОГДА NULL ИНАЧЕ Партия КОНЕЦ
	|УПОРЯДОЧИТЬ ПО ЦеннаяБумага, Партия АВТОУПОРЯДОЧИВАНИЕ;";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СальдироватьПоПартиям", СальдироватьПоПартиям);

	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

Процедура СформироватьДвиженияВОперативномУчете(Отказ)
	
	Если Отказ тогда Возврат; КонецЕсли;
	
	тзАктивы = ПодготовитьТаблицуДанныхВводаЦБ(Ссылка, Ложь);
	
	ВалютаРегУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Для Каждого Строка Из тзАктивы Цикл
		
		Движение = Движения.уа_РасчетыПоЦеннымБумагам.ДобавитьПриход();
		
		Движение.Период 				= Дата;
		Движение.Портфель 				= Портфель;
		Движение.ЦеннаяБумага			= Строка.ЦеннаяБумага;
		Движение.Валюта					= Строка.Валюта;
		Движение.Партия					= Строка.Партия;
		Движение.ОценочнаяКатегория		= ОценочнаяКатегория;
		
		Движение.Количество 							= Строка.Количество;
		Движение.Сумма									= Строка.СуммаВал;
		Движение.СуммаАмортизации						= Строка.СуммаПремииВал - Строка.СуммаДисконтаВал;
		Движение.СуммаПоложительнойПереоценки			= Строка.СуммаПоложительнойПереоценкиВал;
		Движение.СуммаОтрицательнойПереоценки			= Строка.СуммаОтрицательнойПереоценкиВал;
		Движение.СуммаПоложительнойИндексацииНоминала 	= Строка.СуммаПоложительнойИндексацииНоминалаВал;
		Движение.СуммаОтрицательнойИндексацииНоминала	= Строка.СуммаОтрицательнойИндексацииНоминалаВал;    
		Движение.СуммаПоложительнойКорректировки		= Строка.СуммаПоложительнойКорректировкиВал;
		Движение.СуммаОтрицательнойКорректировки		= Строка.СуммаОтрицательнойКорректировкиВал;		
		Движение.НКД									= Строка.НКДВал;
		Движение.УКД									= Строка.УКДВал;
		Движение.СуммаКупонаКПолучению					= Строка.СуммаКупонаКПолучениюВал;
		Движение.СуммаНоминалаКПолучению				= Строка.СуммаНоминалаКПолучениюВал;

		Движение.СуммаРезерва 							= Строка.СуммаРезерваВал;
		Движение.СуммаНУ								= Строка.СуммаНУ;
		
		Если Строка.Валюта <>  ВалютаРегУчета Тогда
			Движение = Движения.уа_РасчетыПоЦеннымБумагам.ДобавитьПриход();
		
			Движение.Период 						= Дата;
			Движение.Портфель 						= Портфель;
			Движение.ЦеннаяБумага					= Строка.ЦеннаяБумага;
			Движение.Валюта							= ВалютаРегУчета;
			Движение.Партия							= Строка.Партия;
			Движение.ОценочнаяКатегория				= ОценочнаяКатегория;
			
			Движение.Количество 							= Строка.Количество;
			Движение.Сумма									= Строка.Сумма;
			Движение.СуммаАмортизации						= Строка.СуммаПремии - Строка.СуммаДисконта;
			Движение.СуммаПоложительнойПереоценки			= Строка.СуммаПоложительнойПереоценки;
			Движение.СуммаОтрицательнойПереоценки			= Строка.СуммаОтрицательнойПереоценки;
			Движение.СуммаПоложительнойИндексацииНоминала 	= Строка.СуммаПоложительнойИндексацииНоминала;
			Движение.СуммаОтрицательнойИндексацииНоминала	= Строка.СуммаОтрицательнойИндексацииНоминала;    
			Движение.СуммаПоложительнойКорректировки		= Строка.СуммаПоложительнойКорректировки;
			Движение.СуммаОтрицательнойКорректировки		= Строка.СуммаОтрицательнойКорректировки;		
			Движение.НКД									= Строка.НКД;
			Движение.УКД									= Строка.УКД;
			Движение.СуммаКупонаКПолучению					= Строка.СуммаКупонаКПолучению;
			Движение.СуммаНоминалаКПолучению				= Строка.СуммаНоминалаКПолучению;
			Движение.СуммаРезерва 							= Строка.СуммаРезерва;
			Движение.СуммаНУ								= Строка.СуммаНУ;
		КонецЕсли; 
		
	КонецЦикла;
	
	Движения.уа_РасчетыПоЦеннымБумагам.Записывать = Истина;  
	
КонецПроцедуры

Процедура СформироватьДвиженияВБухгалтерскомУчете(Отказ, Сальдировать = Истина)
	
	Если Отказ тогда Возврат; КонецЕсли;
	
	тзАктивы = ПодготовитьТаблицуДанныхВводаЦБ(Ссылка, Сальдировать);
	
	СчетОстатков = ПланыСчетов.ЕПС.НайтиПоКоду("000.00");
		
	Для Каждого Строка Из тзАктивы Цикл
		СчетаАктива = уа_БухгалтерскийУчетПовтИсп.СчетаАктива(Дата, Строка.ЦеннаяБумага, ОценочнаяКатегория);
				
		Если Строка.СуммаВал <> 0 Тогда
			Проводка = Движения.ЕПС.Добавить();						
			Проводка.Период			= Дата;
			Проводка.Регистратор 	= Ссылка;
			Проводка.Портфель	 	= Портфель;		
			Проводка.Сумма 			= Строка.Сумма;
			Проводка.Содержание 	= НСтр("ru = 'Ввод начальных остатков по стоимости '");;
			
			Проводка.СчетДт 		= СчетаАктива.СчетУчета;
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ФинансовыеИнструменты, Строка.ЦеннаяБумага);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ВидыСтоимости, Перечисления.уа_ВидыСтоимости.Стоимость);  
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.Партия, Строка.Партия);  
			Проводка.СчетКт 		= СчетОстатков;
			
			уа_БухгалтерскийУчет.ЗаполнитьКоличестваПроводки(Проводка, Строка.Количество);
			уа_БухгалтерскийУчет.ЗаполнитьНалоговыеСуммыПроводки(Проводка, Строка.СуммаНУ);
			уа_БухгалтерскийУчет.ЗаполнитьВалютыИСуммыВалПроводки(Проводка, Строка.Валюта, Строка.СуммаВал);	
		КонецЕсли; 
		
		
		Если Строка.УКДВал <> 0 Тогда
			Проводка = Движения.ЕПС.Добавить();						
			Проводка.Период			= Дата;
			Проводка.Регистратор 	= Ссылка;
			Проводка.Портфель	 	= Портфель;		
			Проводка.Сумма 			= Строка.УКД;
			Проводка.Содержание 	= НСтр("ru = 'Ввод начальных остатков по уплаченному купонному доходу '");;
			
			Проводка.СчетДт 		= СчетаАктива.СчетУчета;
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ФинансовыеИнструменты, Строка.ЦеннаяБумага);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ВидыСтоимости, Перечисления.уа_ВидыСтоимости.УНКД); 
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.Партия, Строка.Партия);  
			Проводка.СчетКт 		= СчетОстатков;
			
			уа_БухгалтерскийУчет.ЗаполнитьНалоговыеСуммыПроводки(Проводка, Строка.УКД);
			уа_БухгалтерскийУчет.ЗаполнитьВалютыИСуммыВалПроводки(Проводка, Строка.Валюта, Строка.УКДВал);			
		КонецЕсли; 
		
		
		Если Строка.НКДВал <> 0 Тогда
			Проводка = Движения.ЕПС.Добавить();						
			Проводка.Период			= Дата;
			Проводка.Регистратор 	= Ссылка;
			Проводка.Портфель	 	= Портфель;		
			Проводка.Сумма 			= Строка.НКД;
			Проводка.Содержание 	= НСтр("ru = 'Ввод начальных остатков по начисленному купонному доходу '");;
			
			Проводка.СчетДт 		= СчетаАктива.СчетУчета;
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ФинансовыеИнструменты, Строка.ЦеннаяБумага);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ВидыСтоимости, Перечисления.уа_ВидыСтоимости.НКД); 
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.Партия, Строка.Партия);  
			Проводка.СчетКт 		= СчетОстатков;
			
			уа_БухгалтерскийУчет.ЗаполнитьНалоговыеСуммыПроводки(Проводка, Строка.НКД);
			уа_БухгалтерскийУчет.ЗаполнитьВалютыИСуммыВалПроводки(Проводка, Строка.Валюта, Строка.НКДВал);	
		КонецЕсли;   
		
		
		Если Строка.СуммаКупонаКПолучению <> 0 Тогда
			Проводка = Движения.ЕПС.Добавить();						
			Проводка.Период			= Дата;
			Проводка.Регистратор 	= Ссылка;
			Проводка.Портфель	 	= Портфель;		
			Проводка.Сумма 			= Строка.СуммаКупонаКПолучению;
			Проводка.Содержание 	= НСтр("ru = 'Ввод начальных остатков по купонному доходу к получению'");;
			
			Проводка.СчетДт 		= СчетаАктива.СчетУчета;
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ФинансовыеИнструменты, Строка.ЦеннаяБумага);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ВидыСтоимости, Перечисления.уа_ВидыСтоимости.КупонКВыплате); 
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.Партия, Строка.Партия);  
			Проводка.СчетКт 		= СчетОстатков;
			
			уа_БухгалтерскийУчет.ЗаполнитьНалоговыеСуммыПроводки(Проводка, Строка.НКД);
			уа_БухгалтерскийУчет.ЗаполнитьВалютыИСуммыВалПроводки(Проводка, Строка.Валюта, Строка.СуммаКупонаКПолучениюВал);	
		КонецЕсли;   
		
		
		Если Строка.СуммаНоминалаКПолучению <> 0 Тогда
			Проводка = Движения.ЕПС.Добавить();						
			Проводка.Период			= Дата;
			Проводка.Регистратор 	= Ссылка;
			Проводка.Портфель	 	= Портфель;		
			Проводка.Сумма 			= Строка.СуммаНоминалаКПолучению;
			Проводка.Содержание 	= НСтр("ru = 'Ввод начальных остатков по номиналу к получению'");;
			
			Проводка.СчетДт 		= СчетаАктива.СчетУчета;
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ФинансовыеИнструменты, Строка.ЦеннаяБумага);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ВидыСтоимости, Перечисления.уа_ВидыСтоимости.НоминалКВыплате); 
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.Партия, Строка.Партия);  
			Проводка.СчетКт 		= СчетОстатков;
			
			уа_БухгалтерскийУчет.ЗаполнитьНалоговыеСуммыПроводки(Проводка, Строка.НКД);
			уа_БухгалтерскийУчет.ЗаполнитьВалютыИСуммыВалПроводки(Проводка, Строка.Валюта, Строка.СуммаНоминалаКПолучениюВал);	
		КонецЕсли;   
		
		
		Если Строка.СуммаПремииВал <> 0 Тогда
			Проводка = Движения.ЕПС.Добавить();
						
			Проводка.Период			= Дата;
			Проводка.Регистратор 	= Ссылка;
			Проводка.Портфель	 	= Портфель;		
			Проводка.Сумма 			= Строка.СуммаПремии;
			Проводка.Содержание 	= НСтр("ru = 'Ввод начальных остатков по премии'");;
			
			Проводка.СчетДт 		= СчетаАктива.СчетУчета;
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ФинансовыеИнструменты, Строка.ЦеннаяБумага);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ВидыСтоимости, Перечисления.уа_ВидыСтоимости.Премия); 
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.Партия, Строка.Партия);  
			Проводка.СчетКт 		= СчетОстатков;
			
			уа_БухгалтерскийУчет.ЗаполнитьВалютыИСуммыВалПроводки(Проводка, Строка.Валюта, Строка.СуммаПремииВал);
		КонецЕсли; 
		
		
		Если Строка.СуммаДисконтаВал <> 0 Тогда
			Проводка = Движения.ЕПС.Добавить();
						
			Проводка.Период			= Дата;
			Проводка.Регистратор 	= Ссылка;
			Проводка.Портфель	 	= Портфель;		
			Проводка.Сумма 			= Строка.СуммаДисконта;
			Проводка.Содержание 	= НСтр("ru = 'Ввод начальных остатков по дисконту'");;
			
			Проводка.СчетДт 		= СчетаАктива.СчетУчета;
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ФинансовыеИнструменты, Строка.ЦеннаяБумага);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ВидыСтоимости, Перечисления.уа_ВидыСтоимости.Дисконт);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.Партия, Строка.Партия);  
			Проводка.СчетКт 		= СчетОстатков;    			
			
			уа_БухгалтерскийУчет.ЗаполнитьВалютыИСуммыВалПроводки(Проводка, Строка.Валюта, Строка.СуммаДисконтаВал);
		КонецЕсли;
		
		
		Если Строка.СуммаПоложительнойИндексацииНоминалаВал > 0 Тогда
			Проводка = Движения.ЕПС.Добавить();
						
			Проводка.Период			= Дата;
			Проводка.Регистратор 	= Ссылка;
			Проводка.Портфель	 	= Портфель;		
			Проводка.Сумма 			= Строка.СуммаПоложительнойИндексацииНоминала;
			Проводка.Содержание 	= НСтр("ru = 'Ввод начальных остатков по положительной индексации номинала'");;
			
			Проводка.СчетДт 		= ?(ОценочнаяКатегория = Перечисления.уа_ОценочнаяКатегория.АктивыПоСправедливойСтоимостиПрибыль, 
				СчетаАктива.ПереоценкаПоложительная, СчетаАктива.КорректировкаУвеличение);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ФинансовыеИнструменты, Строка.ЦеннаяБумага);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ВидыСтоимости, Перечисления.уа_ВидыСтоимости.Индексация);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.Партия, Строка.Партия);  
			Проводка.СчетКт 		= СчетОстатков;

			уа_БухгалтерскийУчет.ЗаполнитьВалютыИСуммыВалПроводки(Проводка, Строка.Валюта, Строка.СуммаПоложительнойИндексацииНоминалаВал);
		КонецЕсли;  
		
		
		Если Строка.СуммаОтрицательнойИндексацииНоминалаВал > 0 Тогда
			Проводка = Движения.ЕПС.Добавить();
						
			Проводка.Период			= Дата;
			Проводка.Регистратор 	= Ссылка;
			Проводка.Портфель	 	= Портфель;		
			Проводка.Сумма 			= Строка.СуммаОтрицательнойИндексацииНоминала;
			Проводка.Содержание 	= НСтр("ru = 'Ввод начальных остатков по отрицательной индексации номинала'");;
			
			Проводка.СчетДт 		= СчетОстатков;
			Проводка.СчетКт 		= ?(ОценочнаяКатегория = Перечисления.уа_ОценочнаяКатегория.АктивыПоСправедливойСтоимостиПрибыль, 
				СчетаАктива.ПереоценкаОтрицательная, СчетаАктива.КорректировкаУменьшение);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ФинансовыеИнструменты, Строка.ЦеннаяБумага);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт,
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ВидыСтоимости, Перечисления.уа_ВидыСтоимости.Индексация);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.Партия, Строка.Партия);          			

			уа_БухгалтерскийУчет.ЗаполнитьВалютыИСуммыВалПроводки(Проводка, Строка.Валюта, Строка.СуммаОтрицательнойИндексацииНоминала);
		КонецЕсли;  
		
		
		Если Строка.СуммаПоложительнойПереоценкиВал > 0 Тогда
			Проводка = Движения.ЕПС.Добавить();
						
			Проводка.Период			= Дата;
			Проводка.Регистратор 	= Ссылка;
			Проводка.Портфель	 	= Портфель;		
			Проводка.Сумма 			= Строка.СуммаПоложительнойПереоценки;
			Проводка.Содержание 	= НСтр("ru = 'Ввод начальных остатков по положительной переоценке'");;
			
			Проводка.СчетДт 		= СчетаАктива.ПереоценкаПоложительная;
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ФинансовыеИнструменты, Строка.ЦеннаяБумага);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ВидыСтоимости, Перечисления.уа_ВидыСтоимости.Стоимость);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.Партия, Строка.Партия);  
				
			Проводка.СчетКт 		= СчетОстатков;			
			
			уа_БухгалтерскийУчет.ЗаполнитьВалютыИСуммыВалПроводки(Проводка, Строка.Валюта, Строка.СуммаПоложительнойПереоценкиВал);	
		КонецЕсли;


		Если Строка.СуммаОтрицательнойПереоценкиВал <> 0 Тогда
			Проводка = Движения.ЕПС.Добавить();
						
			Проводка.Период			= Дата;
			Проводка.Регистратор 	= Ссылка;
			Проводка.Портфель	 	= Портфель;		
			Проводка.Сумма 			= Строка.СуммаОтрицательнойПереоценки;
			Проводка.Содержание 	= НСтр("ru = 'Ввод начальных остатков по отрицательной переоценке'");;
			
			Проводка.СчетДт 		= СчетОстатков;	
			
			Проводка.СчетКт 		= СчетаАктива.ПереоценкаОтрицательная;
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ФинансовыеИнструменты, Строка.ЦеннаяБумага);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ВидыСтоимости, Перечисления.уа_ВидыСтоимости.Стоимость);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.Партия, Строка.Партия);  
			
			уа_БухгалтерскийУчет.ЗаполнитьВалютыИСуммыВалПроводки(Проводка, Строка.Валюта, Строка.СуммаОтрицательнойПереоценкиВал);	
		КонецЕсли;

		Если Строка.СуммаПоложительнойКорректировкиВал <> 0 Тогда
			Проводка = Движения.ЕПС.Добавить();
						
			Проводка.Период			= Дата;
			Проводка.Регистратор 	= Ссылка;
			Проводка.Портфель	 	= Портфель;		
			Проводка.Сумма 			= Строка.СуммаПоложительнойКорректировки;
			Проводка.Содержание 	= НСтр("ru = 'Ввод начальных остатков по положительной корректировке'");;
			
			Проводка.СчетДт 		= СчетаАктива.КорректировкаУвеличение;
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ФинансовыеИнструменты, Строка.ЦеннаяБумага);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ВидыСтоимости, Перечисления.уа_ВидыСтоимости.Стоимость);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.Партия, Строка.Партия);  
				
			Проводка.СчетКт 		= СчетОстатков;			
			
			уа_БухгалтерскийУчет.ЗаполнитьВалютыИСуммыВалПроводки(Проводка, Строка.Валюта, Строка.СуммаПоложительнойКорректировкиВал);	
		КонецЕсли;


		Если Строка.СуммаОтрицательнойКорректировкиВал <> 0 Тогда
			Проводка = Движения.ЕПС.Добавить();
						
			Проводка.Период			= Дата;
			Проводка.Регистратор 	= Ссылка;
			Проводка.Портфель	 	= Портфель;		
			Проводка.Сумма 			= Строка.СуммаОтрицательнойКорректировки;
			Проводка.Содержание 	= НСтр("ru = 'Ввод начальных остатков по отрицательной корректировке'");;
			
			Проводка.СчетДт 		= СчетОстатков;				
			Проводка.СчетКт 		= СчетаАктива.КорректировкаУменьшение;
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ФинансовыеИнструменты, Строка.ЦеннаяБумага);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ВидыСтоимости, Перечисления.уа_ВидыСтоимости.Стоимость);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.Партия, Строка.Партия);  
			
			уа_БухгалтерскийУчет.ЗаполнитьВалютыИСуммыВалПроводки(Проводка, Строка.Валюта, Строка.СуммаОтрицательнойКорректировкиВал);	
		КонецЕсли;
		
		
		Если Строка.СуммаРезерваВал <> 0 Тогда
			Проводка = Движения.ЕПС.Добавить();
						
			Проводка.Период			= Дата;
			Проводка.Регистратор 	= Ссылка;
			Проводка.Портфель	 	= Портфель;		
			Проводка.Сумма 			= -Строка.СуммаРезерва;
			Проводка.Содержание 	= НСтр("ru = 'Ввод начальных остатков по резерву под обесценение'");;
			
			Проводка.СчетДт 		= СчетОстатков;
			Проводка.СчетКт 		= СчетаАктива.РезервыПодОбесценение;
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ФинансовыеИнструменты, Строка.ЦеннаяБумага);
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.ВидыСтоимости, Перечисления.уа_ВидыСтоимости.Стоимость);	
			уа_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 
				ПланыВидовХарактеристик.ВидыСубконтоЕПС.Партия, Строка.Партия);  
			
			уа_БухгалтерскийУчет.ЗаполнитьВалютыИСуммыВалПроводки(Проводка, Строка.Валюта, -Строка.СуммаРезерваВал);
		КонецЕсли;    
		
	КонецЦикла;	
	
	Движения.ЕПС.Записывать = Истина;
КонецПроцедуры

Процедура СформироватьЗаписиВРегистрах(Отказ)
	Если Отказ тогда Возврат; КонецЕсли;

	Для Каждого Строка Из Активы Цикл
		Если Строка.ЦенаАмортизации <> 0 Или Строка.ЦенаНакопленногоДисконта <> 0 Или Строка.ЭСП <> 0	Тогда
			Движение = Движения.уа_ПараметрыРасчетаАмортизации.Добавить();	
			Движение.Период 		= Дата;
			Движение.Портфель 		= Портфель;
			ЗаполнитьЗначенияСвойств(Движение, Строка);
		КонецЕсли; 
	КонецЦикла; 
	
	Движения.уа_ПараметрыРасчетаАмортизации.Записывать = Истина;
КонецПроцедуры
 
#КонецЕсли
